{
    "raw": "Domain Name: BAPESCCLAN.XYZ\r\nRegistry Domain ID: D320980390-CNIC\r\nRegistrar WHOIS Server: whois.aliyun.com\r\nRegistrar URL: http://www.alibabacloud.com\r\nCreation Date: 2022-09-05T04:23:31.0Z\r\nRegistry Expiry Date: 2023-09-05T23:59:59.0Z\r\nRegistrar: ALIBABA.COM SINGAPORE E-COMMERCE PRIVATE LIMITED\r\nRegistrar IANA ID: 3775\r\nDomain Status: serverTransferProhibited https://icann.org/epp#serverTransferProhibited\r\nDomain Status: addPeriod https://icann.org/epp#addPeriod\r\nRegistrant Organization: Xiao\r\nRegistrant State/Province: GD\r\nRegistrant Country: HK\r\nRegistrant Email: Please query the RDDS service of the Registrar of Record identified in this output for information on how to contact the Registrant, Admin, or Tech contact of the queried domain name.\r\nAdmin Email: Please query the RDDS service of the Registrar of Record identified in this output for information on how to contact the Registrant, Admin, or Tech contact of the queried domain name.\r\nTech Email: Please query the RDDS service of the Registrar of Record identified in this output for information on how to contact the Registrant, Admin, or Tech contact of the queried domain name.\r\nName Server: NS7.ALIDNS.COM\r\nName Server: NS8.ALIDNS.COM\r\nDNSSEC: unsigned\r\nBilling Email: Please query the RDDS service of the Registrar of Record identified in this output for information on how to contact the Registrant, Admin, or Tech contact of the queried domain name.\r\nRegistrar Abuse Contact Email: DomainAbuse@service.aliyun.com\r\nRegistrar Abuse Contact Phone: +86.95187\r\nURL of the ICANN Whois Inaccuracy Complaint Form: https://www.icann.org/wicf/\r\n>>> Last update of WHOIS database: 2022-09-06T06:05:50.0Z <<<\r\n\r\nFor more information on Whois status codes, please visit https://icann.org/epp\r\n\r\n>>> IMPORTANT INFORMATION ABOUT THE DEPLOYMENT OF RDAP: please visit\r\nhttps://www.centralnic.com/support/rdap <<<\r\n\r\nThe Whois and RDAP services are provided by CentralNic, and contain\r\ninformation pertaining to Internet domain names registered by our\r\nour customers. By using this service you are agreeing (1) not to use any\r\ninformation presented here for any purpose other than determining\r\nownership of domain names, (2) not to store or reproduce this data in\r\nany way, (3) not to use any high-volume, automated, electronic processes\r\nto obtain data from this service. Abuse of this service is monitored and\r\nactions in contravention of these terms will result in being permanently\r\nblacklisted. All data is (c) CentralNic Ltd (https://www.centralnic.com)\r\n\r\nAccess to the Whois and RDAP services is rate limited. For more\r\ninformation, visit https://registrar-console.centralnic.com/pub/whois_guidance.\r\n",
    "error": "Error: TLD not supported"
}